app/Http/Controllers/ProfilesController.php

    public function show(User $user)
    {
        return view('profiles.show', [
            'profileUser' => $user,
            'threads' => $user->threads()->paginate(30)
---
select count(*) as aggregate from `threads` where `threads`.`user_id` = 51 and `threads`.`user_id` is not null