app/Http/Controllers/ThreadController.php

select * from `replies` where `replies`.`thread_id` = 31 and `replies`.`thread_id` is not null limit 20 offset 0
select count(*) as aggregate from `replies` where `replies`.`thread_id` = 31 and `replies`.`thread_id` is not null
---
    public function show($channel ,Thread $thread)
    {
        return view('threads.show', [
            'thread' => $thread,
            'replies' => $thread->replies()->paginate(20)